Revit 2026 API

# ElectricalDemandFactorValue Class

---

This class represents values used by a particular demand factor definition. Each instance corresponds to a row in a table of values. These values are part of the ElectricalDemandFactorDefinition class.

SystemObject Autodesk.Revit.DB.ElectricalElectricalDemandFactorValue

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElectricalDemandFactorValue : IDisposable
```
```vb
Public Class ElectricalDemandFactorValue
	Implements IDisposable
```
```cpp
public ref class ElectricalDemandFactorValue : IDisposable
```
```fsharp
type ElectricalDemandFactorValue =
    class
        interface IDisposable
    end
```

The ElectricalDemandFactorValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElectricalDemandFactorValue | Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0 |
|  | ElectricalDemandFactorValue(Double, Double, Double) | Constructor. Initializes factor, minimum range and maximum range to values passed in. |

|  | Name | Description |
| --- | --- | --- |
|  | Factor | The demand factor for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the demand factor will be 1.0. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaxRange | The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the maximum range will be 3. |
|  | MinRange | The minimum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the minimum range will be 1. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ElectricalDemandFactorValue |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetMaxRangeToUnlimited | Sets the max range on the value to unlimited |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace